##  <p align="center" style="background-color:#16A085; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Description </p>

# Restaurant Dashboard
- Type of Challenge: `Learning`
- Duration: `8 days`
- Development Deadline: `03/05/2023 4:30 PM`
- Repo Deadline: `12/05/2023 4:00 PM`
- Challenge: Individual (or Team)

![restaurant_food](https://media.giphy.com/media/7JzHsh3UTip20/giphy.gif)


## Mission objectives

- Be able to use data visualization libraries `matplotlib`, `seaborn`, or data tools like PowerBI to explore the data.
- Be able to clean a dataset for analysis.
- Be able to use colors in visualizations correctly.
- Be able to establish conclusions about a dataset.
- Be able to find and answer creative questions about data.
- Be able to think outside the box.
- Be able to create a dashboard containg visualizations that bring business insights to the client.


## The Mission

You are a data analysis consultant at an European travel agency. Your mission is to help the company find business insights from their data that will help them grow their business. 

To do so, you will create a dashboard! What is important to include in the dashboard? Ideally, this dashboard would help travel agents make recommendation to travellers on the best food destination for their trips across Europe.

As a starting point, they provide you with data they scrapped from Trip Advisor, a popular travel website. 

Dataset: [TripAdvisor Restaurants Info for 31 Euro-Cities](https://www.kaggle.com/datasets/damienbeneschi/krakow-ta-restaurans-data-raw)

##  <p align="center" style="background-color:#16A085; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Imports </p>

In [78]:
import pandas as pd 
import numpy as np 
from skimpy import clean_columns
import ast

In [79]:
df = pd.read_csv('../TripAdvisor_Restaurants_31Cities/Assests/TA_restaurants_curated.csv', index_col=None)

In [80]:
df.drop(columns='Unnamed: 0', inplace= True)

##  <p align="center" style="background-color:#16A085; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Data Preproccesing & Cleaning </p>

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125527 entries, 0 to 125526
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Name               125527 non-null  object
 1   City               125527 non-null  object
 2   Cuisine Style      94176 non-null   object
 3   Ranking            115876 non-null  float64
 4   Rating             115897 non-null  float64
 5   Price Range        77672 non-null   object
 6   Number of Reviews  108183 non-null  float64
 7   Reviews            115911 non-null  object
 8   URL_TA             125527 non-null  object
 9   ID_TA              125527 non-null  object
dtypes: float64(3), object(7)
memory usage: 9.6+ MB

In [82]:
df.head(7)

,Name,City,Cuisine Style,Ranking,Rating,Price Range,Number of Reviews,Reviews,URL_TA,ID_TA
0,Martine of Martine's Table,Amsterdam,"['French', 'Dutch', 'European']",1.0,5.0,$$ - $$$,136.0,"[['Just like home', 'A Warm Welcome to Wintry ...",/Restaurant_Review-g188590-d11752080-Reviews-M...,d11752080
1,De Silveren Spiegel,Amsterdam,"['Dutch', 'European', 'Vegetarian Friendly', '...",2.0,4.5,$$$$,812.0,"[['Great food and staff', 'just perfect'], ['0...",/Restaurant_Review-g188590-d693419-Reviews-De_...,d693419
2,La Rive,Amsterdam,"['Mediterranean', 'French', 'International', '...",3.0,4.5,$$$$,567.0,"[['Satisfaction', 'Delicious old school restau...",/Restaurant_Review-g188590-d696959-Reviews-La_...,d696959
3,Vinkeles,Amsterdam,"['French', 'European', 'International', 'Conte...",4.0,5.0,$$$$,564.0,"[['True five star dinner', 'A superb evening o...",/Restaurant_Review-g188590-d1239229-Reviews-Vi...,d1239229
4,Librije's Zusje Amsterdam,Amsterdam,"['Dutch', 'European', 'International', 'Vegeta...",5.0,4.5,$$$$,316.0,"[['Best meal.... EVER', 'super food experience...",/Restaurant_Review-g188590-d6864170-Reviews-Li...,d6864170
5,Ciel Bleu Restaurant,Amsterdam,"['Contemporary', 'International', 'Vegetarian ...",6.0,4.5,$$$$,745.0,"[['A treat!', 'Wow just Wow'], ['01/01/2018', ...",/Restaurant_Review-g188590-d696902-Reviews-Cie...,d696902
6,Zaza's,Amsterdam,"['French', 'International', 'Mediterranean', '...",7.0,4.5,$$ - $$$,1455.0,"[['40th Birthday with my Family', 'One of the ...",/Restaurant_Review-g188590-d1014732-Reviews-Za...,d1014732

In [83]:
# I'm dropping this two columns because I don't need them. 

df.drop(['URL_TA', 'ID_TA','Ranking'],axis = 1, inplace= True)

In [84]:
# I'm going to rename some of the columns make it clear 

df.rename(columns={"Cuisine Style" : "Cuisine", 
                   "Price Range": "PriceRange", 
                   "Number of Reviews" : "Num_Reviews"}, inplace = True)

In [85]:
# functions that showing the percantage of the null values 

def number_nulls(df):
    missing = df.isnull().sum() 
    return missing

def percantage_nulls(serial):
    return serial.isnull().sum() * 100 / serial.shape[0]

In [86]:
for col in df.columns:
    
    print(col + " : " + str(percantage_nulls(df[col])))

Name : 0.0
City : 0.0
Cuisine : 24.975503278179197
Rating : 7.67165629705163
PriceRange : 38.123272284050444
Num_Reviews : 13.816947748293195
Reviews : 7.660503318011265

In [87]:
for col in df.columns:
    
    print(col + " : " + str(number_nulls(df[col])))

Name : 0
City : 0
Cuisine : 31351
Rating : 9630
PriceRange : 47855
Num_Reviews : 17344
Reviews : 9616

Note : 

I saw that there is many Null Values in the raw dataset so let's figure it out how we could handle with tha dataset

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125527 entries, 0 to 125526
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Name         125527 non-null  object
 1   City         125527 non-null  object
 2   Cuisine      94176 non-null   object
 3   Rating       115897 non-null  float64
 4   PriceRange   77672 non-null   object
 5   Num_Reviews  108183 non-null  float64
 6   Reviews      115911 non-null  object
dtypes: float64(2), object(5)
memory usage: 6.7+ MB

 ! I'm going to search all of the columns 1 by 1

In [89]:
# filling null values according to related values with  groupby methods and their mode and medians  
df.PriceRange.fillna(df.groupby(["City", "Cuisine"])["PriceRange"].agg({pd.Series.mode}).values[0,0], inplace=True)
df.Rating.fillna(df.groupby(["City", "Cuisine", "PriceRange"])["Rating"].agg({pd.Series.mode}).values[0,0], inplace=True)
df.Num_Reviews.fillna(df.groupby(["City", "Cuisine", "PriceRange", "Rating"])["Num_Reviews"].agg({pd.Series.mean}).values[0,0], inplace=True)

In [90]:
df.City.unique()

array(['Amsterdam', 'Athens', 'Barcelona', 'Berlin', 'Bratislava',
       'Brussels', 'Budapest', 'Copenhagen', 'Dublin', 'Edinburgh',
       'Geneva', 'Hamburg', 'Helsinki', 'Krakow', 'Lisbon', 'Ljubljana',
       'London', 'Luxembourg', 'Lyon', 'Madrid', 'Milan', 'Munich',
       'Oporto', 'Oslo', 'Paris', 'Prague', 'Rome', 'Stockholm', 'Vienna',
       'Warsaw', 'Zurich'], dtype=object)

In [91]:
#Creating a dictionary for each city as keys and their countries as values
countryDict = {
    "Amsterdam"  : "Netherlands",
    "Athens"     : "Greece",
    "Barcelona"  : "Spain",
    "Madrid"     : "Spain",
    "Berlin"     : "Germany",
    "Hamburg"    : "Germany",
    "Munich"     : "Germany",
    "Bratislava" : "Slovakia",
    "Brussels"   : "Belgium",
    "Budapest"   : "Hungary",
    "Copenhagen" : "Denmark",
    "Dublin"     : "Ireland",
    "Edinburgh"  : "United Kingdom",
    "Geneva"     : "Italy",
    "Milan"      : "Italy",
    "Rome"       : "Italy",
    "Helsinki"   : "Finland",
    "Krakow"     : "Poland",
    "Warsaw"     : "Poland",
    "Lisbon"     : "Portugal",
    "Oporto"     : "Portugal",
    "Ljubljana"  : "Slovenia",
    "London"     : "United Kingdom",
    "Luxembourg" : "Luxembourg",
    "Lyon"       : "France",
    "Paris"      : "France",
    "Oslo"       : "Norway",
    "Prague"     : "Czech Republic",
    "Stockholm"  : "Sweden",
    "Vienna"     : "Austria",
    "Zurich"     : "Switzerland"
}

df["Country"] = [countryDict[i] for i in df.City]

### <p align="center" style="background-color:#FFA500; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Column 0 : Name  </p>

In [92]:
df.Name.value_counts(dropna=False)

McDonald's                   326
Burger King                  175
Subway                       130
Pizza Express                100
Domino's Pizza                88
                            ...
Estaca Zero                    1
Expressoes da Nossa Terra      1
Pateo Restaurante              1
Restaurante BarAlto            1
dieci                          1
Name: Name, Length: 111927, dtype: int64

### <p align="center" style="background-color:#FFA500; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Column 1 : City   </p>

In [93]:
df.City.value_counts(dropna=False)

London        18212
Paris         14874
Madrid         9543
Barcelona      8425
Berlin         7078
Milan          6687
Rome           5949
Prague         4859
Lisbon         3986
Vienna         3724
Amsterdam      3434
Brussels       3204
Hamburg        3131
Munich         2995
Lyon           2930
Stockholm      2705
Budapest       2606
Warsaw         2352
Copenhagen     2109
Dublin         2082
Athens         1938
Edinburgh      1865
Zurich         1667
Oporto         1580
Geneva         1572
Krakow         1354
Helsinki       1228
Oslo           1213
Bratislava     1067
Luxembourg      657
Ljubljana       501
Name: City, dtype: int64

### <p align="center" style="background-color:#FFA500; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Column 2 : Cuisine   </p>

In [94]:
df['Cuisine'].value_counts(dropna=False)

NaN                                                                             31351
['Italian']                                                                      3473
['French']                                                                       2569
['Spanish']                                                                      2130
['Cafe']                                                                         1492
                                                                                ...
['Cafe', 'Polish', 'European', 'Spanish', 'Israeli', 'Vegetarian Friendly']         1
['Polish', 'Bar', 'European', 'Eastern European', 'Central European', 'Pub']        1
['Polish', 'Bar', 'European', 'Pub', 'Brew Pub']                                    1
['French', 'European', 'Seafood', 'Vegetarian Friendly']                            1
['Italian', 'French', 'Swiss', 'European', 'Spanish', 'Portuguese']                 1
Name: Cuisine, Length: 20972, dtype: int64

 I'm going to change the name of the column as Cuisine and I will change null values with Unknown because in the visualization it could be important

In [95]:
def transform(line):
    try:
        txt = ""
        line = ast.literal_eval(line)
        for i in range(len(line)):
            if i != len(line)-1:
                txt += line[i] + ","
            else:
                txt += line[i]
    except:
        txt = ""
    return txt

#Applying the function
df.Cuisine = df.Cuisine.apply(lambda x : transform(x))

In [96]:
df.tail()

,Name,City,Cuisine,Rating,PriceRange,Num_Reviews,Reviews,Country
125522,Konrad Kaffee- & Cocktailbar,Zurich,,4.5,$,70.0,NaN,Switzerland
125523,Blueberry American Bakery,Zurich,Cafe,4.5,$,70.0,NaN,Switzerland
125524,Restaurant Bahnhof,Zurich,,4.5,$,70.0,NaN,Switzerland
125525,Yoyo Pizza,Zurich,Fast Food,4.5,$,70.0,NaN,Switzerland
125526,dieci,Zurich,"Italian,Pizza,Mediterranean,Diner",4.5,$$ - $$$,70.0,NaN,Switzerland

In [97]:
#Here, I created a dictionary to hold the all cuisine types.
#I used it to fill some of the missing cuisine values, from the restaurant name.
#If the restaurant has its cuisine type inside of its name, fill the missing value with it.
cuisineDict = {}
for i in df.Cuisine:
    arr = i.split(",")
    for j in range(len(arr)):
        if arr[j] in cuisineDict:
            cuisineDict[arr[j]] += 1
        else:
            cuisineDict[arr[j]] = 1
               
for i in cuisineDict:
    df.loc[(df.Name.str.lower().str.contains(i.lower()) & (df.Cuisine == "")), "Cuisine"] = i

In [98]:
df.drop(df[df.Cuisine == ""].index, inplace = True)

In [99]:
for i in ["Mediterranean", "Central European", "Eastern European", "European", "Scandinavian", "Vegetarian Friendly"]:
    df.loc[df.Cuisine.str.contains(("," + i)), "Cuisine"] =  df.loc[df.Cuisine.str.contains(("," + i)), "Cuisine"].replace(("," + i), "", regex = True)
    df.loc[df.Cuisine.str.contains((i + ",")), "Cuisine"] =  df.loc[df.Cuisine.str.contains((i + ",")), "Cuisine"].replace((i + ","), "", regex = True)
    
#Now I can just keep the first cuisine in the list
df.Cuisine = df.Cuisine.apply(lambda x : x.split(",")[0])

In [100]:
df.head()

,Name,City,Cuisine,Rating,PriceRange,Num_Reviews,Reviews,Country
0,Martine of Martine's Table,Amsterdam,French,5.0,$$ - $$$,136.0,"[['Just like home', 'A Warm Welcome to Wintry ...",Netherlands
1,De Silveren Spiegel,Amsterdam,Dutch,4.5,$$$$,812.0,"[['Great food and staff', 'just perfect'], ['0...",Netherlands
2,La Rive,Amsterdam,French,4.5,$$$$,567.0,"[['Satisfaction', 'Delicious old school restau...",Netherlands
3,Vinkeles,Amsterdam,French,5.0,$$$$,564.0,"[['True five star dinner', 'A superb evening o...",Netherlands
4,Librije's Zusje Amsterdam,Amsterdam,Dutch,4.5,$$$$,316.0,"[['Best meal.... EVER', 'super food experience...",Netherlands

In [101]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100541 entries, 0 to 125526
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Name         100541 non-null  object
 1   City         100541 non-null  object
 2   Cuisine      100541 non-null  object
 3   Rating       100541 non-null  float64
 4   PriceRange   100541 non-null  object
 5   Num_Reviews  100541 non-null  float64
 6   Reviews      94553 non-null   object
 7   Country      100541 non-null  object
dtypes: float64(2), object(6)
memory usage: 6.9+ MB

In [102]:
df.head()

,Name,City,Cuisine,Rating,PriceRange,Num_Reviews,Reviews,Country
0,Martine of Martine's Table,Amsterdam,French,5.0,$$ - $$$,136.0,"[['Just like home', 'A Warm Welcome to Wintry ...",Netherlands
1,De Silveren Spiegel,Amsterdam,Dutch,4.5,$$$$,812.0,"[['Great food and staff', 'just perfect'], ['0...",Netherlands
2,La Rive,Amsterdam,French,4.5,$$$$,567.0,"[['Satisfaction', 'Delicious old school restau...",Netherlands
3,Vinkeles,Amsterdam,French,5.0,$$$$,564.0,"[['True five star dinner', 'A superb evening o...",Netherlands
4,Librije's Zusje Amsterdam,Amsterdam,Dutch,4.5,$$$$,316.0,"[['Best meal.... EVER', 'super food experience...",Netherlands

### <p align="center" style="background-color:#FFA500; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Column 3 : Rating   </p>

In [103]:
df.Rating.value_counts(dropna=False)

 4.0    33836
 4.5    32542
 3.5    16420
 5.0     7947
 3.0     6233
 2.5     1933
 2.0      962
 1.0      371
 1.5      260
-1.0       37
Name: Rating, dtype: int64

In [104]:
#Dropping data with rating below 0.
df.drop(df[df.Rating < 0].index, inplace = True)

In [105]:
df.Rating.value_counts(dropna=False)

4.0    33836
4.5    32542
3.5    16420
5.0     7947
3.0     6233
2.5     1933
2.0      962
1.0      371
1.5      260
Name: Rating, dtype: int64

### <p align="center" style="background-color:#FFA500; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Column 4 : PriceRange   </p>

In [106]:
df.PriceRange.value_counts(dropna=False)

$$ - $$$    54345
$           41854
$$$$         4305
Name: PriceRange, dtype: int64

In [107]:
#Replacing price range with a string values.
df.replace({"$": 'Cheap', "$$ - $$$": 'Avarage', "$$$$": 'Expensive'}, inplace = True)

In [108]:
df.head()

,Name,City,Cuisine,Rating,PriceRange,Num_Reviews,Reviews,Country
0,Martine of Martine's Table,Amsterdam,French,5.0,Avarage,136.0,"[['Just like home', 'A Warm Welcome to Wintry ...",Netherlands
1,De Silveren Spiegel,Amsterdam,Dutch,4.5,Expensive,812.0,"[['Great food and staff', 'just perfect'], ['0...",Netherlands
2,La Rive,Amsterdam,French,4.5,Expensive,567.0,"[['Satisfaction', 'Delicious old school restau...",Netherlands
3,Vinkeles,Amsterdam,French,5.0,Expensive,564.0,"[['True five star dinner', 'A superb evening o...",Netherlands
4,Librije's Zusje Amsterdam,Amsterdam,Dutch,4.5,Expensive,316.0,"[['Best meal.... EVER', 'super food experience...",Netherlands

### <p align="center" style="background-color:#FFA500; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Column 5 : Num_Reviews  </p>

In [109]:
df.Num_Reviews.describe()

count    100504.000000
mean        139.566485
std         319.033424
min           2.000000
25%          16.000000
50%          61.000000
75%         126.000000
max       16478.000000
Name: Num_Reviews, dtype: float64

In [110]:
df.Num_Reviews.value_counts(dropna=False)

70.0      10769
2.0        3361
3.0        2854
4.0        2332
5.0        2122
          ...
1958.0        1
4329.0        1
2578.0        1
1532.0        1
1974.0        1
Name: Num_Reviews, Length: 2079, dtype: int64

### <p align="center" style="background-color:#FFA500; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Column 5 : Num_Reviews  </p>

In [111]:
df.Country.value_counts()

United Kingdom    17122
France            13841
Spain             13676
Italy             12018
Germany            9317
Portugal           4373
Czech Republic     4176
Netherlands        3010
Poland             2958
Austria            2896
Belgium            2542
Hungary            2237
Sweden             2057
Ireland            1825
Denmark            1742
Greece             1589
Switzerland        1371
Finland            1035
Norway             1000
Slovakia            736
Luxembourg          559
Slovenia            424
Name: Country, dtype: int64

### <p align="center" style="background-color:#FFA500; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Restraunt Recommedations for every cities  </p>

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100504 entries, 0 to 125526
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Name         100504 non-null  object
 1   City         100504 non-null  object
 2   Cuisine      100504 non-null  object
 3   Rating       100504 non-null  float64
 4   PriceRange   100504 non-null  object
 5   Num_Reviews  100504 non-null  float64
 6   Reviews      94517 non-null   object
 7   Country      100504 non-null  object
dtypes: float64(2), object(6)
memory usage: 6.9+ MB

In [113]:
#  I'm going to make a Recommedations for each cities 
def select_restaurant(group):
    sorted_group = group.sort_values(['Num_Reviews', 'Rating'], ascending=False)
    return sorted_group.iloc[0]['Name']

Recommedations = df.groupby(['City', 'PriceRange']).apply(select_restaurant).reset_index()

In [114]:
Recommedations

         City PriceRange                          0
0   Amsterdam    Avarage   Hard Rock Cafe Amsterdam
1   Amsterdam      Cheap                Wok to Walk
2   Amsterdam  Expensive                     De Kas
3      Athens    Avarage  Ta Karamanlidika tou Fani
4      Athens      Cheap                 O Thanasis
..        ...        ...                        ...
88     Warsaw      Cheap                   Zapiecek
89     Warsaw  Expensive              Polska Rozana
90     Zurich    Avarage             Zeughauskeller
91     Zurich      Cheap              Sternen Grill
92     Zurich  Expensive                     Clouds

[93 rows x 3 columns]

##  <p align="center" style="background-color:#16A085; font-family:newtimeroman; color:#FFF9ED; font-size:120%; border-radius:10px 10px;"> Export for Visualizations on Tableau  </p>

In [115]:
df.to_csv('../TripAdvisor_Restaurants_31Cities/Assests/Cleaned_TripAdvisor_Restraunts.csv')
Recommedations.to_csv('../TripAdvisor_Restaurants_31Cities/Assests/RecommedationsRestraunts.csv')